
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |        1 |          65 |            4 |
## Affected resources by action

|  Action  | Resources                                                                                           |
|:--------:|:----------------------------------------------------------------------------------------------------|
|    🟡    | `module.jumphost.aws_autoscaling_group.jumphost`                                                    |
|    🟡    | `module.jumphost.aws_efs_file_system.home`                                                          |
|    🟡    | `module.jumphost.aws_iam_policy.required`                                                           |
|    🟡    | `module.jumphost.aws_launch_template.jumphost`                                                      |
|    🟡    | `module.jumphost.aws_lb.jumphost`                                                                   |
|    🟡    | `module.jumphost.aws_lb_listener.jumphost`                                                          |
|    🟡    | `module.jumphost.aws_lb_target_group.jumphost`                                                      |
|    🟡    | `module.jumphost.aws_security_group.efs`                                                            |
|    🟡    | `module.jumphost.aws_security_group.jumphost`                                                       |
|    🟡    | `module.jumphost.aws_vpc_security_group_egress_rule.default`                                        |
|    🟡    | `module.jumphost.aws_vpc_security_group_egress_rule.efs`                                            |
|    🟡    | `module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-04b8845d896c6ebde"]`              |
|    🟡    | `module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-06caf71c8b0afd909"]`              |
|    🟡    | `module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-0df885dcc99418799"]`              |
|    🟡    | `module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-0f91dd2675e7a16c3"]`              |
|    🟡    | `module.jumphost.aws_vpc_security_group_ingress_rule.efs["subnet-06caf71c8b0afd909"]`               |
|    🟡    | `module.jumphost.aws_vpc_security_group_ingress_rule.efs["subnet-0f91dd2675e7a16c3"]`               |
|    🟡    | `module.jumphost.aws_vpc_security_group_ingress_rule.efs_icmp`                                      |
|    🟡    | `module.jumphost.aws_vpc_security_group_ingress_rule.icmp`                                          |
|    🟡    | `module.jumphost.aws_vpc_security_group_ingress_rule.ssh`                                           |
|    🟡    | `module.mail_twindb_com.aws_autoscaling_group.postfix`                                              |
|    🟡    | `module.mail_twindb_com.aws_iam_policy.required`                                                    |
|    🟡    | `module.mail_twindb_com.aws_launch_template.postfix`                                                |
|    🟡    | `module.vpn.aws_autoscaling_group.openvpn`                                                          |
|    🟡    | `module.vpn.aws_efs_file_system.openvpn-config`                                                     |
|    🟡    | `module.vpn.aws_key_pair.deployer`                                                                  |
|    🟡    | `module.vpn.aws_launch_template.openvpn`                                                            |
|    🟡    | `module.vpn.aws_lb.openvpn`                                                                         |
|    🟡    | `module.vpn.aws_lb_listener.openvpn`                                                                |
|    🟡    | `module.vpn.aws_lb_target_group.openvpn`                                                            |
|    🟡    | `module.vpn.aws_security_group.efs`                                                                 |
|    🟡    | `module.vpn.aws_security_group.openvpn`                                                             |
|    🟡    | `module.vpn.aws_vpc_security_group_egress_rule.default`                                             |
|    🟡    | `module.vpn.aws_vpc_security_group_egress_rule.efs`                                                 |
|    🟡    | `module.vpn.aws_vpc_security_group_ingress_rule.efs`                                                |
|    🟡    | `module.vpn.aws_vpc_security_group_ingress_rule.efs_icmp`                                           |
|    🟡    | `module.vpn.aws_vpc_security_group_ingress_rule.icmp`                                               |
|    🟡    | `module.vpn.aws_vpc_security_group_ingress_rule.openvpn`                                            |
|    🟡    | `module.vpn.aws_vpc_security_group_ingress_rule.ssh`                                                |
|    🟡    | `module.vpn.module.ca_passkey.aws_secretsmanager_secret.secret`                                     |
|    🟡    | `module.vpn.module.flask_secret_key.aws_secretsmanager_secret.secret`                               |
|    🟡    | `module.vpn.module.google_client.aws_secretsmanager_secret.secret`                                  |
|    🟡    | `module.vpn.module.instance_profile.aws_iam_policy.profile`                                         |
|    🟡    | `module.vpn.module.openvpn-portal.aws_ecs_capacity_provider.ecs`                                    |
|    🟡    | `module.vpn.module.openvpn-portal.aws_ecs_cluster.ecs`                                              |
|    🟡    | `module.vpn.module.openvpn-portal.aws_ecs_service.ecs`                                              |
|    🟡    | `module.vpn.module.openvpn-portal.aws_ecs_task_definition.ecs`                                      |
|    🟡    | `module.vpn.module.openvpn-portal.aws_iam_role.ecs_task_execution_role`                             |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_acm_certificate.website`                           |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_alb.website`                                       |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_alb_target_group.website`                          |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website`                         |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website`                           |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_lb_listener.ssl`                                   |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_s3_bucket.access_log[0]`                           |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_s3_bucket_policy.access_logs[0]`                   |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_security_group.alb`                                |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_security_group.backend`                            |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing`       |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing`   |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp`          |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port` |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp`      |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local` |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.https`             |
|    🔴    | `module.vpn.module.openvpn-portal.aws_security_group.backend_extra`                                 |
|    🔴    | `module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_reserved`       |
|    🔴    | `module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_user`           |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.jumphost.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ",
            ]
        }
    }

  # module.jumphost.aws_autoscaling_group.jumphost will be updated in-place
  ~ resource "aws_autoscaling_group" "jumphost" {
        id                               = "jumphost-20240223005113359100000009-02R7BZ"
        name                             = "jumphost-20240223005113359100000009-02R7BZ"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-001743d1d2257c40b"
            name    = "jumphost-20240223005113359100000009"
          ~ version = "11" -> (known after apply)
        }

      + tag {
          + key                 = "account"
          + propagate_at_launch = true
          + value               = "493370826424"
        }
      + tag {
          + key                 = "created_by"
          + propagate_at_launch = true
          + value               = "infrahouse/aws-control-493370826424"
        }
      + tag {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "production"
        }
      + tag {
          + key                 = "service"
          + propagate_at_launch = true
          + value               = "jumphost"
        }

        # (4 unchanged blocks hidden)
    }

  # module.jumphost.aws_efs_file_system.home will be updated in-place
  ~ resource "aws_efs_file_system" "home" {
        id                              = "fs-0cbd3749548d04da6"
        name                            = "jumphost-home"
      ~ tags                            = {
            "Name"              = "jumphost-home"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all                        = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jumphost.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-20240223005145929800000014"
        name             = "terraform-20240223005145929800000014"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags             = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all         = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/jumphost/aws"
          + "service"           = "jumphost"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.jumphost.aws_launch_template.jumphost will be updated in-place
  ~ resource "aws_launch_template" "jumphost" {
        id                                   = "lt-001743d1d2257c40b"
      ~ latest_version                       = 11 -> (known after apply)
        name                                 = "jumphost-20240223005113359100000009"
      ~ tags                                 = {
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all                             = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "account"           = "493370826424"
              + "created_by"        = "infrahouse/aws-control-493370826424"
              + "created_by_module" = "infrahouse/jumphost/aws"
              + "environment"       = "production"
              + "service"           = "jumphost"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "account"           = "493370826424"
              + "created_by"        = "infrahouse/aws-control-493370826424"
              + "created_by_module" = "infrahouse/jumphost/aws"
              + "environment"       = "production"
              + "service"           = "jumphost"
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.jumphost.aws_lb.jumphost will be updated in-place
  ~ resource "aws_lb" "jumphost" {
        id                                                           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/net/jumpho20240226175403880200000003/b3fc749d99e1aea6"
        name                                                         = "jumpho20240226175403880200000003"
      ~ tags                                                         = {
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all                                                     = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.jumphost.aws_lb_listener.jumphost will be updated in-place
  ~ resource "aws_lb_listener" "jumphost" {
        id                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/net/jumpho20240226175403880200000003/b3fc749d99e1aea6/91aca9d503ce64cc"
      ~ tags              = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all          = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/jumphost/aws"
          + "service"           = "jumphost"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jumphost.aws_lb_target_group.jumphost will be updated in-place
  ~ resource "aws_lb_target_group" "jumphost" {
        id                                 = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/jumpho20240226175402900300000002/e819b391374f847e"
        name                               = "jumpho20240226175402900300000002"
      ~ tags                               = {
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all                           = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.jumphost.aws_security_group.efs will be updated in-place
  ~ resource "aws_security_group" "efs" {
        id                     = "sg-02906b36c9d1be156"
        name                   = "jumphost-efs-20240226175402899600000001"
      ~ tags                   = {
            "Name"              = "Jumphost EFS home"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.jumphost.aws_security_group.jumphost will be updated in-place
  ~ resource "aws_security_group" "jumphost" {
        id                     = "sg-0bc8f2feda3620f6f"
        name                   = "jumphost20240223005112035100000006"
      ~ tags                   = {
            "Name"              = "jumphost"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_egress_rule.default will be updated in-place
  ~ resource "aws_vpc_security_group_egress_rule" "default" {
        id                     = "sgr-09df3a8ea086f41c3"
      ~ tags                   = {
            "Name"              = "outgoing traffic"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_egress_rule.efs will be updated in-place
  ~ resource "aws_vpc_security_group_egress_rule" "efs" {
        id                     = "sgr-0db18bc63ee576445"
      ~ tags                   = {
            "Name"              = "EFS outgoing traffic"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-04b8845d896c6ebde"] will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "echo" {
        id                     = "sgr-0c73403993b37a047"
      ~ tags                   = {
            "Name"              = "Echo access from subnet-04b8845d896c6ebde"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-06caf71c8b0afd909"] will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "echo" {
        id                     = "sgr-0c6aa081d8fee4b06"
      ~ tags                   = {
            "Name"              = "Echo access from subnet-06caf71c8b0afd909"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-0df885dcc99418799"] will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "echo" {
        id                     = "sgr-01aa164b2135fd7c3"
      ~ tags                   = {
            "Name"              = "Echo access from subnet-0df885dcc99418799"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-0f91dd2675e7a16c3"] will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "echo" {
        id                     = "sgr-020eef95402397b9c"
      ~ tags                   = {
            "Name"              = "Echo access from subnet-0f91dd2675e7a16c3"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.efs["subnet-06caf71c8b0afd909"] will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "efs" {
        id                     = "sgr-062acb6f39fde831e"
      ~ tags                   = {
            "Name"              = "NFS traffic"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.efs["subnet-0f91dd2675e7a16c3"] will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "efs" {
        id                     = "sgr-0444ad8346816a952"
      ~ tags                   = {
            "Name"              = "NFS traffic"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.efs_icmp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "efs_icmp" {
        id                     = "sgr-05152071ab2f7b9e3"
      ~ tags                   = {
            "Name"              = "ICMP traffic"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.icmp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "icmp" {
        id                     = "sgr-0335952ea4ac17465"
      ~ tags                   = {
            "Name"              = "ICMP traffic"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.ssh will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "ssh" {
        id                     = "sgr-08214d93ee7212b60"
      ~ tags                   = {
            "Name"              = "SSH access"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
          + "service"           = "jumphost"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "service"           = "jumphost"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.mail_twindb_com.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881",
            ]
        }
    }

  # module.mail_twindb_com.aws_autoscaling_group.postfix will be updated in-place
  ~ resource "aws_autoscaling_group" "postfix" {
        id                               = "postfix-20240326221552532900000008-5Qy881"
        name                             = "postfix-20240326221552532900000008-5Qy881"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0e5d85805b1236e19"
            name    = "postfix-20240326221552532900000008"
          ~ version = "12" -> (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.mail_twindb_com.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-2024032622160941250000000a"
        name             = "terraform-2024032622160941250000000a"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_launch_template.postfix will be updated in-place
  ~ resource "aws_launch_template" "postfix" {
        id                                   = "lt-0e5d85805b1236e19"
      ~ image_id                             = "ami-0cf0c9fe4bfb45d2b" -> "ami-0819a8650d771b8be"
      ~ latest_version                       = 12 -> (known after apply)
        name                                 = "postfix-20240326221552532900000008"
        tags                                 = {
            "created_by_module" = "infrahouse/postfix/aws"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.data.aws_iam_policy_document.instance_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "instance_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sts:GetCallerIdentity",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:ModifyInstanceAttribute",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "openvpn-2024070518392010580000001e-nRBgZQ",
                ]
              + variable = "ec2:ResourceTag/aws:autoscaling:groupName"
            }
        }
    }

  # module.vpn.aws_autoscaling_group.openvpn will be updated in-place
  ~ resource "aws_autoscaling_group" "openvpn" {
        id                               = "openvpn-2024070518392010580000001e-nRBgZQ"
        name                             = "openvpn-2024070518392010580000001e-nRBgZQ"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0f7a032c61f3f5094"
            name    = "openvpn-2024070518392010580000001e"
          ~ version = "5" -> (known after apply)
        }

      + tag {
          + key                 = "account"
          + propagate_at_launch = true
          + value               = "493370826424"
        }
      + tag {
          + key                 = "created_by"
          + propagate_at_launch = true
          + value               = "infrahouse/aws-control-493370826424"
        }
      + tag {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "production"
        }

        # (5 unchanged blocks hidden)
    }

  # module.vpn.aws_efs_file_system.openvpn-config will be updated in-place
  ~ resource "aws_efs_file_system" "openvpn-config" {
        id                              = "fs-030af57faac6dc979"
        name                            = "openvpn-config"
      ~ tags                            = {
            "Name"              = "openvpn-config"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "service"           = "openvpn"
        }
      ~ tags_all                        = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.aws_key_pair.deployer will be updated in-place
  ~ resource "aws_key_pair" "deployer" {
        id              = "terraform-2024070518391434530000000d"
      ~ tags            = {
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "service"           = "openvpn"
        }
      ~ tags_all        = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
            # (3 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpn.aws_launch_template.openvpn will be updated in-place
  ~ resource "aws_launch_template" "openvpn" {
        id                                   = "lt-0f7a032c61f3f5094"
      ~ image_id                             = "ami-0cf0c9fe4bfb45d2b" -> "ami-0819a8650d771b8be"
      ~ latest_version                       = 5 -> (known after apply)
        name                                 = "openvpn-2024070518392010580000001e"
      ~ tags                                 = {
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "service"           = "openvpn"
        }
      ~ tags_all                             = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "account"           = "493370826424"
              + "created_by"        = "infrahouse/aws-control-493370826424"
              + "created_by_module" = "infrahouse/openvpn/aws"
              + "environment"       = "development"
              + "service"           = "openvpn"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "account"           = "493370826424"
              + "created_by"        = "infrahouse/aws-control-493370826424"
              + "created_by_module" = "infrahouse/openvpn/aws"
              + "environment"       = "development"
              + "service"           = "openvpn"
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.vpn.aws_lb.openvpn will be updated in-place
  ~ resource "aws_lb" "openvpn" {
        id                                                           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/net/openvp20240705183914699100000012/646588147f729d73"
        name                                                         = "openvp20240705183914699100000012"
      ~ tags                                                         = {
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "service"           = "openvpn"
        }
      ~ tags_all                                                     = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.vpn.aws_lb_listener.openvpn will be updated in-place
  ~ resource "aws_lb_listener" "openvpn" {
        id                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/net/openvp20240705183914699100000012/646588147f729d73/137463f1949e7787"
      ~ tags              = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
          + "service"           = "openvpn"
        }
      ~ tags_all          = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.aws_lb_target_group.openvpn will be updated in-place
  ~ resource "aws_lb_target_group" "openvpn" {
        id                                 = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/openvp2024070518391321130000000b/b47c256497661b5d"
        name                               = "openvp2024070518391321130000000b"
      ~ tags                               = {
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "service"           = "openvpn"
        }
      ~ tags_all                           = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.vpn.aws_security_group.efs will be updated in-place
  ~ resource "aws_security_group" "efs" {
        id                     = "sg-0dd3fd02dfce04dc1"
        name                   = "openvpn-efs-20240705183912621400000007"
      ~ tags                   = {
            "Name"              = "OpenVPN config"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "service"           = "openvpn"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.aws_security_group.openvpn will be updated in-place
  ~ resource "aws_security_group" "openvpn" {
        id                     = "sg-075e48ded6c152d0e"
        name                   = "openvpn20240705183912621300000006"
      ~ tags                   = {
            "Name"              = "openvpn"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "service"           = "openvpn"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.aws_vpc_security_group_egress_rule.default will be updated in-place
  ~ resource "aws_vpc_security_group_egress_rule" "default" {
        id                     = "sgr-07224f228aad12567"
      ~ tags                   = {
            "Name"              = "outgoing traffic"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "service"           = "openvpn"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpn.aws_vpc_security_group_egress_rule.efs will be updated in-place
  ~ resource "aws_vpc_security_group_egress_rule" "efs" {
        id                     = "sgr-07a581f3a051c9e38"
      ~ tags                   = {
            "Name"              = "EFS outgoing traffic"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "service"           = "openvpn"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpn.aws_vpc_security_group_ingress_rule.efs will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "efs" {
        id                     = "sgr-0307a1d37733b1012"
      ~ tags                   = {
            "Name"              = "NFS traffic"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "service"           = "openvpn"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.aws_vpc_security_group_ingress_rule.efs_icmp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "efs_icmp" {
        id                     = "sgr-01adfc3c790748117"
      ~ tags                   = {
            "Name"              = "ICMP traffic"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "service"           = "openvpn"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.aws_vpc_security_group_ingress_rule.icmp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "icmp" {
        id                     = "sgr-0a9d1f465b9895b48"
      ~ tags                   = {
            "Name"              = "ICMP traffic"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "service"           = "openvpn"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.aws_vpc_security_group_ingress_rule.openvpn will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "openvpn" {
        id                     = "sgr-05e5a24993ee0013c"
      ~ tags                   = {
            "Name"              = "OpenVPN access"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "service"           = "openvpn"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.aws_vpc_security_group_ingress_rule.ssh will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "ssh" {
        id                     = "sgr-0ed7be34a1f7f8d30"
      ~ tags                   = {
            "Name"              = "SSH access"
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "service"           = "openvpn"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.module.ca_passkey.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/vpn.ca_passkey/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:openvpn_ca_passphrase20240705183916567800000017-QSFUZ3",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.vpn.module.ca_passkey.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:openvpn_ca_passphrase20240705183916567800000017-QSFUZ3"
        name                           = "openvpn_ca_passphrase20240705183916567800000017"
      ~ tags                           = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "openvpn"
        }
      ~ tags_all                       = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpn.module.flask_secret_key.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/vpn.flask_secret_key/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:flask_secret_key20240705183915732100000013-0srsRS",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.vpn.module.flask_secret_key.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:flask_secret_key20240705183915732100000013-0srsRS"
        name                           = "flask_secret_key20240705183915732100000013"
      ~ tags                           = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "openvpn"
        }
      ~ tags_all                       = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpn.module.google_client.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/vpn.google_client/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:google_client20240705183915856300000015-9EuJ0W",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.vpn.module.google_client.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:google_client20240705183915856300000015-9EuJ0W"
        name                           = "google_client20240705183915856300000015"
      ~ tags                           = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          + "environment"       = "development"
            "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "openvpn"
        }
      ~ tags_all                       = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/openvpn/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpn.module.instance_profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::493370826424:policy/openvpn-8u1hU4OyuQDT20240705183937201200000024"
        name             = "openvpn-8u1hU4OyuQDT20240705183937201200000024"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:GetCallerIdentity"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ec2:DescribeInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = "ec2:ModifyInstanceAttribute"
                      - Condition = {
                          - StringEquals = {
                              - "ec2:ResourceTag/aws:autoscaling:groupName" = "openvpn-2024070518392010580000001e-nRBgZQ"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.aws_ecs_capacity_provider.ecs will be updated in-place
  ~ resource "aws_ecs_capacity_provider" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:capacity-provider/openvpn-portal"
        name     = "openvpn-portal"
      ~ tags     = {
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
          + "environment"       = "development"
          ~ "module_version"    = "3.5.0" -> "3.7.0"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
          ~ "module_version"    = "3.5.0" -> "3.7.0"
          + "service"           = "openvpn-portal"
            # (2 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.module.openvpn-portal.aws_ecs_cluster.ecs will be updated in-place
  ~ resource "aws_ecs_cluster" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:cluster/openvpn-portal"
        name     = "openvpn-portal"
      ~ tags     = {
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
          + "environment"       = "development"
          ~ "module_version"    = "3.5.0" -> "3.7.0"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
          ~ "module_version"    = "3.5.0" -> "3.7.0"
          + "service"           = "openvpn-portal"
            # (2 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.module.openvpn-portal.aws_ecs_service.ecs will be updated in-place
  ~ resource "aws_ecs_service" "ecs" {
        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/openvpn-portal/openvpn-portal"
        name                               = "openvpn-portal"
      ~ tags                               = {
          - "backend_security_group"          = "eyJiYWNrZW5kIjp7ImlkIjoic2ctMGI2MjQ0YjkwOGIzMGE2NmQiLCJydWxlcyI6eyJiYWNrZW5kX2ljbXAiOiJzZ3ItMDg4NGZjYmYxNmViNzA4YTgiLCJiYWNrZW5kX291dGdvaW5nIjoic2dyLTAyOWE2MGFiM2ZmZWI5YjNlIiwiYmFja2VuZF9zc2hfaW5wdXQiOm51bGwsImJhY2tlbmRfc3NoX2xvY2FsIjoic2dyLTBiZjBiYzM5MGY3"
          - "created_by_module"               = "infrahouse/ecs/aws"
          - "execution_role_arn"              = "arn:aws:iam::493370826424:role/openvpn-portalTaskExecutionRole20240705183912611900000005"
          - "instance_role_policy_attachment" = "openvpn-portal-instance-j8szhwpnnnfu20240705183912601000000001-20240705183914452000000010"
          - "instance_role_policy_name"       = "openvpn-portal-instance-j8szhwpnnnfu2024070518391381960000000c"
          - "load_balancer_arn"               = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/openvp2024070518391751950000001c/539fb530eebce408"
          - "module_version"                  = "3.5.0"
          - "target_group_arn"                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-2024070518391297700000000a/a48a76cdd3cd12a8"
        } -> (known after apply)
      ~ tags_all                           = {
          - "backend_security_group"          = "eyJiYWNrZW5kIjp7ImlkIjoic2ctMGI2MjQ0YjkwOGIzMGE2NmQiLCJydWxlcyI6eyJiYWNrZW5kX2ljbXAiOiJzZ3ItMDg4NGZjYmYxNmViNzA4YTgiLCJiYWNrZW5kX291dGdvaW5nIjoic2dyLTAyOWE2MGFiM2ZmZWI5YjNlIiwiYmFja2VuZF9zc2hfaW5wdXQiOm51bGwsImJhY2tlbmRfc3NoX2xvY2FsIjoic2dyLTBiZjBiYzM5MGY3"
          - "created_by"                      = "infrahouse/aws-control-493370826424"
          - "created_by_module"               = "infrahouse/ecs/aws"
          - "environment"                     = "production"
          - "execution_role_arn"              = "arn:aws:iam::493370826424:role/openvpn-portalTaskExecutionRole20240705183912611900000005"
          - "instance_role_policy_attachment" = "openvpn-portal-instance-j8szhwpnnnfu20240705183912601000000001-20240705183914452000000010"
          - "instance_role_policy_name"       = "openvpn-portal-instance-j8szhwpnnnfu2024070518391381960000000c"
          - "load_balancer_arn"               = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/openvp2024070518391751950000001c/539fb530eebce408"
          - "module_version"                  = "3.5.0"
          - "target_group_arn"                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-2024070518391297700000000a/a48a76cdd3cd12a8"
        } -> (known after apply)
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.aws_ecs_task_definition.ecs will be updated in-place
  ~ resource "aws_ecs_task_definition" "ecs" {
        id                       = "openvpn-portal"
      ~ tags                     = {
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
          + "environment"       = "development"
          ~ "module_version"    = "3.5.0" -> "3.7.0"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all                 = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
          ~ "module_version"    = "3.5.0" -> "3.7.0"
          + "service"           = "openvpn-portal"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.module.openvpn-portal.aws_iam_role.ecs_task_execution_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "openvpn-portalTaskExecutionRole20240705183912611900000005"
        name                  = "openvpn-portalTaskExecutionRole20240705183912611900000005"
      ~ tags                  = {
          + "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
          + "environment"       = "development"
          ~ "module_version"    = "3.5.0" -> "3.7.0"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all              = {
          + "account"           = "493370826424"
          ~ "environment"       = "production" -> "development"
          ~ "module_version"    = "3.5.0" -> "3.7.0"
          + "service"           = "openvpn-portal"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.aws_security_group.backend_extra will be destroyed
  # (because aws_security_group.backend_extra is not in configuration)
  - resource "aws_security_group" "backend_extra" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group/sg-0b6595dd62b412fc4" -> null
      - description            = "Backend extrac security group for service openvpn-portal" -> null
      - egress                 = [] -> null
      - id                     = "sg-0b6595dd62b412fc4" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "ECS reserved ports for service openvpn-portal"
              - from_port        = 2375
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 2376
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "ECS user traffic ports for service openvpn-portal"
              - from_port        = 32768
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "openvpn-portal-2024070518391440710000000e" -> null
      - name_prefix            = "openvpn-portal-" -> null
      - owner_id               = "493370826424" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"              = "ECS openvpn-portal backend"
          - "created_by_module" = "infrahouse/ecs/aws"
          - "module_version"    = "3.5.0"
        } -> null
      - tags_all               = {
          - "Name"              = "ECS openvpn-portal backend"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/ecs/aws"
          - "environment"       = "production"
          - "module_version"    = "3.5.0"
        } -> null
      - vpc_id                 = "vpc-08e19d859c26d18b2" -> null
    }

  # module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_reserved will be destroyed
  # (because aws_vpc_security_group_ingress_rule.backend_extra_reserved is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "backend_extra_reserved" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-04121d07477ccac76" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "ECS reserved ports for service openvpn-portal" -> null
      - from_port              = 2375 -> null
      - id                     = "sgr-04121d07477ccac76" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-0b6595dd62b412fc4" -> null
      - security_group_rule_id = "sgr-04121d07477ccac76" -> null
      - tags                   = {
          - "Name"              = "ECS reserved"
          - "created_by_module" = "infrahouse/ecs/aws"
          - "module_version"    = "3.5.0"
        } -> null
      - tags_all               = {
          - "Name"              = "ECS reserved"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/ecs/aws"
          - "environment"       = "production"
          - "module_version"    = "3.5.0"
        } -> null
      - to_port                = 2376 -> null
    }

  # module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_user will be destroyed
  # (because aws_vpc_security_group_ingress_rule.backend_extra_user is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "backend_extra_user" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0ece0a93c49897a2b" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "ECS user traffic ports for service openvpn-portal" -> null
      - from_port              = 32768 -> null
      - id                     = "sgr-0ece0a93c49897a2b" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-0b6595dd62b412fc4" -> null
      - security_group_rule_id = "sgr-0ece0a93c49897a2b" -> null
      - tags                   = {
          - "Name"              = "ECS user traffic"
          - "created_by_module" = "infrahouse/ecs/aws"
          - "module_version"    = "3.5.0"
        } -> null
      - tags_all               = {
          - "Name"              = "ECS user traffic"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/ecs/aws"
          - "environment"       = "production"
          - "module_version"    = "3.5.0"
        } -> null
      - to_port                = 65535 -> null
    }

  # module.vpn.module.openvpn-portal.module.pod.data.aws_iam_policy_document.access_logs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "access_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::openvp-access-log-20240705183912611100000004/AWSLogs/493370826424/*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::027434742980:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_acm_certificate.website will be updated in-place
  ~ resource "aws_acm_certificate" "website" {
        id                        = "arn:aws:acm:us-west-1:493370826424:certificate/c84df691-5e46-46d7-b58e-91dd7cdb1614"
      ~ tags                      = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all                  = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn-portal"
            # (1 unchanged element hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_alb.website will be updated in-place
  ~ resource "aws_alb" "website" {
        id                                                           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/openvp2024070518391751950000001c/539fb530eebce408"
        name                                                         = "openvp2024070518391751950000001c"
      ~ tags                                                         = {
            "access_log_bucket"        = "openvp-access-log-20240705183912611100000004"
            "access_log_bucket_policy" = "openvp-access-log-20240705183912611100000004"
            "account"                  = "493370826424"
          + "created_by_module"        = "infrahouse/website-pod/aws"
            "environment"              = "development"
          - "managed-by"               = "terraform" -> null
            "service"                  = "openvpn-portal"
        }
      ~ tags_all                                                     = {
          + "created_by_module"        = "infrahouse/website-pod/aws"
          - "managed-by"               = "terraform" -> null
            # (6 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_alb_target_group.website will be updated in-place
  ~ resource "aws_alb_target_group" "website" {
        id                                 = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-2024070518391297700000000a/a48a76cdd3cd12a8"
        name                               = "tf-2024070518391297700000000a"
      ~ tags                               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all                           = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn-portal"
            # (1 unchanged element hidden)
        }
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "openvp2024070518391750040000001b"
        name                             = "openvp2024070518391750040000001b"
        # (32 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0ef83181fbf251354"
            name    = "openvp20240705183917137600000019"
          ~ version = "5" -> (known after apply)
        }

      - tag {
          - key                 = "environment" -> null
          - propagate_at_launch = true -> null
          - value               = "development" -> null
        }
      - tag {
          - key                 = "managed-by" -> null
          - propagate_at_launch = true -> null
          - value               = "terraform" -> null
        }
      - tag {
          - key                 = "parent_module_version" -> null
          - propagate_at_launch = true -> null
          - value               = "3.5.0" -> null
        }
      + tag {
          + key                 = "created_by"
          + propagate_at_launch = true
          + value               = "infrahouse/aws-control-493370826424"
        }
      + tag {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "production"
        }
      + tag {
          + key                 = "parent_module_version"
          + propagate_at_launch = true
          + value               = "3.7.0"
        }

        # (8 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-0ef83181fbf251354"
      ~ image_id                             = "ami-06886ac35c1b2ce5b" -> "ami-005f49c015a732aa0"
      ~ latest_version                       = 5 -> (known after apply)
        name                                 = "openvp20240705183917137600000019"
        tags                                 = {}
      ~ vpc_security_group_ids               = [
          - "sg-0b6595dd62b412fc4",
            # (1 unchanged element hidden)
        ]
        # (15 unchanged attributes hidden)

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "account"           = "493370826424"
              + "created_by"        = "infrahouse/aws-control-493370826424"
              + "created_by_module" = "infrahouse/website-pod/aws"
              + "environment"       = "development"
              + "service"           = "openvpn-portal"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "account"           = "493370826424"
              + "created_by"        = "infrahouse/aws-control-493370826424"
              + "created_by_module" = "infrahouse/website-pod/aws"
              + "environment"       = "development"
              + "service"           = "openvpn-portal"
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_lb_listener.ssl will be updated in-place
  ~ resource "aws_lb_listener" "ssl" {
        id                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/openvp2024070518391751950000001c/539fb530eebce408/f6f06f03b6060c16"
      ~ tags              = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all          = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn-portal"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_s3_bucket.access_log[0] will be updated in-place
  ~ resource "aws_s3_bucket" "access_log" {
        id                          = "openvp-access-log-20240705183912611100000004"
      ~ tags                        = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all                    = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn-portal"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_s3_bucket_policy.access_logs[0] will be updated in-place
  ~ resource "aws_s3_bucket_policy" "access_logs" {
        id     = "openvp-access-log-20240705183912611100000004"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::027434742980:root"
                        }
                      - Resource  = "arn:aws:s3:::openvp-access-log-20240705183912611100000004/AWSLogs/493370826424/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_security_group.alb will be updated in-place
  ~ resource "aws_security_group" "alb" {
        id                     = "sg-05caa8c6b76ccae52"
        name                   = "web-20240705183912974600000009"
      ~ tags                   = {
            "Name"              = "openvpn-portal load balancer"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn-portal"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_security_group.backend will be updated in-place
  ~ resource "aws_security_group" "backend" {
        id                     = "sg-0b6244b908b30a66d"
        name                   = "web-20240705183912601900000002"
      ~ tags                   = {
            "Name"              = "openvpn-portal backend"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn-portal"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing will be updated in-place
  ~ resource "aws_vpc_security_group_egress_rule" "alb_outgoing" {
        id                     = "sgr-089893ce9044603cd"
      ~ tags                   = {
            "Name"              = "outgoing traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn-portal"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing will be updated in-place
  ~ resource "aws_vpc_security_group_egress_rule" "backend_outgoing" {
        id                     = "sgr-029a60ab3ffeb9b3e"
      ~ tags                   = {
            "Name"              = "outgoing traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn-portal"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "alb_icmp" {
        id                     = "sgr-04bdde4f57aec86c1"
      ~ tags                   = {
            "Name"              = "ICMP traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn-portal"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "alb_listener_port" {
        id                     = "sgr-0a1cee338b47dcea0"
      ~ tags                   = {
            "Name"              = "user traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn-portal"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "backend_icmp" {
        id                     = "sgr-0884fcbf16eb708a8"
      ~ tags                   = {
            "Name"              = "ICMP traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn-portal"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "backend_ssh_local" {
        id                     = "sgr-0bf0bc390f71cf1a3"
      ~ tags                   = {
            "Name"              = "SSH local"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn-portal"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_user_traffic must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "backend_user_traffic" {
      ~ arn                          = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0ea3d0e82b8e2b61d" -> (known after apply)
      - cidr_ipv4                    = "10.0.0.0/22" -> null # forces replacement
      ~ description                  = "User traffic from the Load Balancer" -> "Any traffic from the Load Balancer"
      - from_port                    = 8080 -> null
      ~ id                           = "sgr-0ea3d0e82b8e2b61d" -> (known after apply)
      ~ ip_protocol                  = "tcp" -> "-1"
      + referenced_security_group_id = "sg-05caa8c6b76ccae52" # forces replacement
      ~ security_group_rule_id       = "sgr-0ea3d0e82b8e2b61d" -> (known after apply)
      ~ tags                         = {
          ~ "Name"              = "user traffic" -> "Load balancer traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all                     = {
          ~ "Name"              = "user traffic" -> "Load balancer traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn-portal"
            # (1 unchanged element hidden)
        }
      - to_port                      = 8080 -> null
        # (1 unchanged attribute hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.https will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "https" {
        id                     = "sgr-06ed0124bcfb148db"
      ~ tags                   = {
            "Name"              = "https user traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "openvpn-portal"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "openvpn-portal"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 65 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEsICJjaGFuZ2UiOiA2NSwgImRlc3Ryb3kiOiA0fX0=
```
</details>